In [1]:
print('hello')

hello

In [2]:
import pandas
print(pandas.__version__)

2.2.2

In [3]:
import pandas as pd
print(pd.__version__)

2.2.2

In [4]:
l = [1,2,3,4,5]
x = pd.Series(l)
print(x)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
l = [1,2,3,4,5]
x = pd.Series(l, index=('a','b','c','d','e'), name='python', dtype=float)
print(x)

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: python, dtype: float64

In [7]:
t = 'python'
z=pd.Series(t)
print(z)

0    python
dtype: object

In [8]:
p = {1:2, 3:4, 5:6, 10:11}
f = pd.Series(p)
print(f)
print(type(f))

1      2
3      4
5      6
10    11
dtype: int64
<class 'pandas.core.series.Series'>

In [9]:
# DataFrame

name = ['Rahul', 'Pavan', 'Queen', 'King', 'Ravi']
area = ['Pune', 'Delhi', 'Bangalore', 'Noida', 'Punewest']
Math = [34,67,89,100,45]
English = [66,88,99,77,34]
Science = [77,88,45,90,23]

Details = {'Name':name, "Area":area, "Math":Math, "English":English,"Science":Science}
data = pd.DataFrame(Details)
print(data)

    Name       Area  Math  English  Science
0  Rahul       Pune    34       66       77
1  Pavan      Delhi    67       88       88
2  Queen  Bangalore    89       99       45
3   King      Noida   100       77       90
4   Ravi   Punewest    45       34       23

In [10]:
data.head()

    Name       Area  Math  English  Science
0  Rahul       Pune    34       66       77
1  Pavan      Delhi    67       88       88
2  Queen  Bangalore    89       99       45
3   King      Noida   100       77       90
4   Ravi   Punewest    45       34       23

In [11]:
data.head(2)

    Name   Area  Math  English  Science
0  Rahul   Pune    34       66       77
1  Pavan  Delhi    67       88       88

In [13]:
print(data.shape)

(5, 5)

In [14]:
data.tail(3) # prints last 3 rows

    Name       Area  Math  English  Science
2  Queen  Bangalore    89       99       45
3   King      Noida   100       77       90
4   Ravi   Punewest    45       34       23

In [15]:
data.describe()

             Math    English    Science
count    5.000000   5.000000   5.000000
mean    67.000000  72.800000  64.600000
std     28.044607  24.933913  29.415982
min     34.000000  34.000000  23.000000
25%     45.000000  66.000000  45.000000
50%     67.000000  77.000000  77.000000
75%     89.000000  88.000000  88.000000
max    100.000000  99.000000  90.000000

In [16]:
data.shape()

TypeError: 'tuple' object is not callable

In [18]:
print(data.shape)

(5, 5)

In [19]:
data[2:4:2]

    Name       Area  Math  English  Science
2  Queen  Bangalore    89       99       45

In [20]:
data[2:4:]

    Name       Area  Math  English  Science
2  Queen  Bangalore    89       99       45
3   King      Noida   100       77       90

In [21]:
data['Name'] # only one column

0    Rahul
1    Pavan
2    Queen
3     King
4     Ravi
Name: Name, dtype: object

In [22]:
data[['Name', "English"]] # multiple columns

    Name  English
0  Rahul       66
1  Pavan       88
2  Queen       99
3   King       77
4   Ravi       34

In [23]:
data[['Name','English']][2:5:1]

    Name  English
2  Queen       99
3   King       77
4   Ravi       34

In [26]:
# fetch details of each row
for i in data.iterrows():
    print(i)

(0, Name       Rahul
Area        Pune
Math          34
English       66
Science       77
Name: 0, dtype: object)
(1, Name       Pavan
Area       Delhi
Math          67
English       88
Science       88
Name: 1, dtype: object)
(2, Name           Queen
Area       Bangalore
Math              89
English           99
Science           45
Name: 2, dtype: object)
(3, Name        King
Area       Noida
Math         100
English       77
Science       90
Name: 3, dtype: object)
(4, Name           Ravi
Area       Punewest
Math             45
English          34
Science          23
Name: 4, dtype: object)

In [27]:
# hw: 10 rows and 10 columns